app/controllers/guesses_controller.rb

SELECT "guesses".* FROM "guesses" ORDER BY created_at DESC
---
  def index
    @guesses = Guess.all.order("created_at DESC")

INSERT INTO "guesses" ("created_at", "definition", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", Thu, 05 Dec 2013 04:42:15 UTC +00:00], ["definition", "Lying nearby but lower."], ["updated_at", Thu, 05 Dec 2013 04:42:15 UTC +00:00], ["username", "gost"]]
---
  def create
    @guess = Guess.new
    @guess.username = params[:username]
    @guess.definition = params[:definition]
    Rails.logger.debug(params.inspect)


    respond_to do |format|
      if @guess.save

SELECT "guesses".* FROM "guesses" WHERE "guesses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @guess = Guess.find(params[:id])