app/controllers/solutions_controller.rb

SELECT "solutions".* FROM "solutions"
---
  def index
    @solutions = Solution.all

INSERT INTO "solutions" ("created_at", "number", "time", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 07 Dec 2013 04:08:45 UTC +00:00], ["number", 123], ["time", "00:01"], ["updated_at", Sat, 07 Dec 2013 04:08:45 UTC +00:00], ["username", "gost"]]
---
  def create
    @solution = Solution.new
    @solution.time = params[:time]
    @solution.number = params[:number].to_i
    @solution.username = params[:username]

    respond_to do |format|
      if @solution.save