app/controllers/users_controller.rb

SELECT "solutions".* FROM "solutions" WHERE "solutions"."username" = 'gost' ORDER BY created_at DESC
SELECT "guesses".* FROM "guesses" WHERE "guesses"."username" = 'gost' ORDER BY created_at DESC
---
  def index
    username = params[:username]
    @solutions = Solution.all.where(:username => username).order("created_at DESC")
    @guesses = Guess.all.where(:username => username).order("created_at DESC")